/*
 * memory.h ver. 1.1
 *
 *  Created on: 2011/08/01
 *      Author: noname
 */

#ifndef MEM_H_

#define MEM_H_

#define MEM_KERN 1
#define MEM_USER 2


/*---------------------------------------------------------------------------
  メモリ確保
    int size: 利用メモリサイズ

    return: 確保したメモリへのポインタ
            エラーの場合はNULLを返す
---------------------------------------------------------------------------*/
void* mem_alloc(int size);


/*---------------------------------------------------------------------------
  メモリ解放
    *ptr: 確保したメモリへのポインタ
    return: エラーの場合は負の値を返す
---------------------------------------------------------------------------*/
s32 mem_free(void *ptr);

#endif
